In [1]:
import pandas as pd

In [2]:
two_dm_list = [['dongwook', 50, 86], ['sineui',89,31],['ijoong', 68,91], ['yoonsoo',88,75]]

In [3]:
my_df = pd.DataFrame(two_dm_list, columns=['name', 'english_score', 'math_score'])
my_df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2    ijoong             68          91
3   yoonsoo             88          75

In [4]:
type(my_df)

pandas.core.frame.DataFrame

In [5]:
my_df.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

In [6]:
my_df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]

In [8]:
my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'english_score', 'math_score'], index=['a', 'b', 'c', 'd'])

In [9]:
print(my_df.dtypes)

name             object
english_score     int64
math_score        int64
dtype: object

In [10]:
my_df

       name  english_score  math_score
a  dongwook             50          86
b    sineui             89          31
c   ikjoong             68          91
d   yoonsoo             88          75